# 数据库概论第二次实习报告
### 小组成员：王子恒 1800012972， 唐浩然 1800012976

In [491]:
%reload_ext sql
import pymysql 
pymysql.install_as_MySQLdb()
# %sql mysql://stu2101213030:stu2101213030@162.105.146.37:43306
%sql mysql://stu1800012972:stu1800012972@162.105.146.37:43306
%sql show databases;
%sql use stu1800012972;

 * mysql://stu1800012972:***@162.105.146.37:43306
3 rows affected.
 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.

[]

## 练习一：生成身份证号

In [492]:
%%sql
drop table if exists myxzqh;
create table myxzqh(code varchar(30), name varchar(30)) select * from dataset.xzqh;
# show tables;
# select * from myxzqh;

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
3218 rows affected.
0 rows affected.

[]

### (1) 生成校验码的函数

In [493]:
%%sql 
DROP FUNCTION if exists GetCheckCode;

create function GetCheckCode (id char(17))
returns char
begin

    declare sum,i int;
    declare weights varchar(100);
    declare curweight varchar(3);
    declare mp char(11);
    declare ans char;

    set sum=0;
    set i=1;
    set weights='7 9 10 5 8 4 2 1 6 3 7 9 10 5 8 4 2 ';
    set mp='10X98765432';

    while i<=17 do
        set curweight=left(weights, instr(weights,' ')-1);
        set weights=right(weights, length(weights)-instr(weights,' '));
        set sum =sum + cast(curweight as signed) * substr(id,i,1);
        set i=i+1;
    end while;

    set sum=sum%11;
    set ans = substr(mp,sum+1,1);

    return ans;
end

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

以实习ppt中的例子为例测试：

In [494]:
%sql select stu1800012972.GetCheckCode(43283119641115081);

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[('0',)]

### (2) 定义存储过程，构造省份证号

In [495]:
%%sql
DROP PROCEDURE if exists GenerateID;

create procedure GenerateID(province varchar(20),city varchar(20),district varchar(20),
                            birthdate date,gender varchar(20))
begin
    declare i1516, i17 int;
    declare id varchar(18);

    set id = (select code from stu1800012972.myxzqh where name=district);
    set i1516=floor(rand()*100);
    set i17 = floor(rand()*4)*2;
    if gender='男' then set i17=i17+1; end if;

    set id = concat(id,date_format(birthdate,"%Y%m%d"));
    set id = concat(id,lpad(i1516,2,'0'));
    set id = concat(id,i17) ;
    set id = concat(id, GetCheckCode(id));
    select id;
end

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

测试该存储过程

In [496]:
%%sql
call GenerateID('浙江省','杭州市','余杭区','2000-07-12','女');

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[('33011020000712354X',)]

In [497]:
%%sql
call GenerateID('江苏省','南京市','江宁区','1981-03-05','男');

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[('320115198103053676',)]

## 练习二：触发器

In [541]:
%%sql
drop table if exists my_stock;

create table my_stock(
    stock_id int, volume int, avg_price double, profit int,
    PRIMARY KEY (`stock_id`))

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [542]:
%%sql 
drop table if exists trans;

create table trans(
    trans_id int, stock_id int, date int, price int, amount int ,sell_or_buy char,
    PRIMARY KEY (`trans_id`))

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

我们构造辅助表`buy_trans`，记录当前各条买入记录分别还剩下多少股票，方便计算profit

In [543]:
%%sql
drop table if exists buy_trans;

create table buy_trans(
    trans_id int, stock_id int, price int, amount int,
    PRIMARY KEY(`trans_id`))

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [544]:
%%sql
drop trigger if exists UpdateStock;

create trigger UpdateStock before insert on trans
for each row
begin

    declare ptr_transid, ptr_stockid,ptr_price,ptr_amount int;
    declare ptr cursor for select * from buy_trans order by `trans_id` asc;

    # 如果买入且没有该股票，在my_stock中新建一个条目
    # 如果卖出且没有该股票，报错
    if new.stock_id not in (select stock_id from my_stock where stock_id=new.stock_id) then 
        if new.sell_or_buy='B' then
            INSERT INTO my_stock(stock_id, volume, avg_price, profit) 
                    VALUES (new.stock_id, 0, 0,0);
        else 
            SIGNAL SQLSTATE '02000' SET MESSAGE_TEXT = 
                                            'Warning: invalid trans: sold stock not exists!';  
        end if;
    end if;

    if new.sell_or_buy='B' then 
        # 买入，更新avg_price与volume
        update my_stock set 
                        avg_price=(volume*avg_price+new.price*new.amount)/(volume+new.amount),
                        volume=volume+new.amount where my_stock.stock_id=new.stock_id;

        # 向 buy_trans中加入一条新的买入记录
        insert into buy_trans(trans_id, stock_id, price, amount) 
                values(new.trans_id, new.stock_id, new.price, new.amount);

    elseif new.sell_or_buy='S' then
        if new.amount <= (select volume from my_stock where stock_id=new.stock_id) then 
            set @rest_amount=new.amount;
            set @cur_profit=0;
            set @cur_amount=0;
            set @cur_price=0;

            open ptr;

            # 游标遍历买入记录表，按顺序计算卖出各个记录获得的profit
            label: loop
                fetch ptr into ptr_transid, ptr_stockid, ptr_price, ptr_amount;
                if ptr_stockid!=new.stock_id then iterate label;
                end if;
                set @cur_amount=least(@rest_amount,ptr_amount);
                set @cur_profit=@cur_profit+(new.price-ptr_price)*@cur_amount;
                set @rest_amount=@rest_amount-@cur_amount;
                set @cur_price=@cur_price+new.price*@cur_amount;
                update buy_trans set amount=ptr_amount-@cur_amount 
                                where buy_trans.trans_id=ptr_transid;    
                if @rest_amount<=0 then leave label;
                end if;
            end loop;

            close ptr;

            # 删掉已经没有剩余股票的买入记录
            delete from buy_trans where amount=0;

            # 更新avg_price, volume, profit
            # 注意卖光了不能除
            update my_stock set 
                        avg_price= case when volume-new.amount!=0 
                                then (volume*avg_price-@cur_price)/(volume-new.amount) 
                                else 0 end,
                        volume=volume-new.amount, profit=profit+@cur_profit
                        where my_stock.stock_id=new.stock_id;
        else 
            SIGNAL SQLSTATE '02000' SET MESSAGE_TEXT = 
                        'Warning: invalid trans: sold amount greater than current volume!';    
        end if;

    end if;

end

 * mysql://stu1800012972:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

以ppt中的例子测试

In [545]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(1,1,1,10,1000,'B');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[(1, 1, 1, 10, 1000, 'B')]

In [546]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 1, 10, 1000)]

In [547]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 1000, 10.0, 0)]

In [548]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(2,1,2,11,500,'B');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
2 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B')]

In [549]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 1, 10, 1000), (2, 1, 11, 500)]

In [550]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 1500, 10.333333333333334, 0)]

In [551]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(3,1,3,12,800,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
3 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B'), (3, 1, 3, 12, 800, 'S')]

In [552]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 1, 10, 200), (2, 1, 11, 500)]

In [553]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 700, 8.428571428571429, 1600)]

In [554]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(4,1,4,12,1000,'S');

 * mysql://stu1800012972:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1643, 'Warning: invalid trans: sold amount greater than current volume!')
[SQL: INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(4,1,4,12,1000,'S');]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

因为sell的股票数大于现有的股票数，我们报错

In [555]:
%%sql
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
3 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B'), (3, 1, 3, 12, 800, 'S')]

In [556]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(5,1,5,9,1000,'B');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
4 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B')]

In [557]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
3 rows affected.

[(1, 1, 10, 200), (2, 1, 11, 500), (5, 1, 9, 1000)]

In [558]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 1700, 8.764705882352942, 1600)]

In [559]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(6,1,6,12,800,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
5 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S')]

In [560]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(5, 1, 9, 900)]

这一次，我们卖了200\*2+500\*1+100\*3=1200，前两条记录清空

In [561]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 900, 5.888888888888891, 2800)]

In [562]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(7,1,7,7,800,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
6 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S')]

In [563]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(5, 1, 9, 100)]

In [564]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(1, 100, -2.999999999999982, 1200)]

测试不同编号的股票不会互相影响

In [565]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(8,2,7,7,1000,'B');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
7 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B')]

In [566]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(5, 1, 9, 100), (8, 2, 7, 1000)]

In [567]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 1000, 7.0, 0)]

In [568]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(9,2,7,6,800,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
8 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B'),
 (9, 2, 7, 6, 800, 'S')]

In [569]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(5, 1, 9, 100), (8, 2, 7, 200)]

In [570]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 200, 11.0, -800)]

In [571]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(10,2,7,8,200,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
9 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B'),
 (9, 2, 7, 6, 800, 'S'),
 (10, 2, 7, 8, 200, 'S')]

In [572]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(5, 1, 9, 100)]

In [573]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 0, 0.0, -600)]

再买一次2号股票

In [574]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(11,2,7,8,200,'B');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
10 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B'),
 (9, 2, 7, 6, 800, 'S'),
 (10, 2, 7, 8, 200, 'S'),
 (11, 2, 7, 8, 200, 'B')]

In [575]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(5, 1, 9, 100), (11, 2, 8, 200)]

In [576]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 200, 8.0, -600)]

In [577]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(12,2,7,7,200,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.
11 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B'),
 (9, 2, 7, 6, 800, 'S'),
 (10, 2, 7, 8, 200, 'S'),
 (11, 2, 7, 8, 200, 'B'),
 (12, 2, 7, 7, 200, 'S')]

In [578]:
%%sql
select * from buy_trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
1 rows affected.

[(5, 1, 9, 100)]

我们保留2号股票卖光之前的profit；
8买入，7卖出200，又赔了200，现在profit是-800

In [579]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 0, 0.0, -800)]

尝试卖出一个不存在的3号股票，报错

In [580]:
%%sql
INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(13,3,7,8,200,'S');
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1643, 'Warning: invalid trans: sold stock not exists!')
[SQL: INSERT INTO trans(trans_id, stock_id, date, price, amount,sell_or_buy) VALUES(13,3,7,8,200,'S');]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [581]:
%%sql
select * from trans;

 * mysql://stu1800012972:***@162.105.146.37:43306
11 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S'),
 (8, 2, 7, 7, 1000, 'B'),
 (9, 2, 7, 6, 800, 'S'),
 (10, 2, 7, 8, 200, 'S'),
 (11, 2, 7, 8, 200, 'B'),
 (12, 2, 7, 7, 200, 'S')]

In [582]:
%%sql
select * from my_stock;

 * mysql://stu1800012972:***@162.105.146.37:43306
2 rows affected.

[(1, 100, -2.999999999999982, 1200), (2, 0, 0.0, -800)]